//
//  main.swift
//  Swift_Init
//
//  Created by JM Zhao on 2017/5/3.
//  Copyright © 2017年 JunMing. All rights reserved.
//

import Foundation

// 初始化
/*
 初始化视为类, 结构体, 枚举准备实例的过程, 这个过程需要给实例里的每一个存储属性设置一个初始值并且在新实例可以使用之前
 执行任何其他所必须的配置或初始化, 
 你通过定义初始化器来实现这个初始化过程, 它更像是一个用来创建特定类型新势力的特殊方法, 不同于OC中的初始化器, Swift中初始化器不返回值
 这些初始化器主要的角色就是确保早第一次使用之前某类型的新实例能够正确初始化
 类类型的实例同样可以实现一个反初始化器, 他会在这个类的实例被释放之前执行任意的自定义清理,
 */

// 为存储属性设置初始化值
// 在创建类和结构体的实例时必须为所有的存储属性设置一个合适的初始值, 存储属性不能遗留在不确定状态

/*
 
 初始化器
 初始化器在创建特定类型的实例时被调用, 在这个简单的形式中, 初始化器就像是一个没有参数的实例方法, 使用init 关键字
 init() {

     // 初始化操作写在这里
 }
*/

struct <#name#> {
    <#fields#>
}























































